---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTable.Remove(Autodesk.Revit.DB.ExportPatternKey)
zh: 删除、移除
source: html/c154bdf0-be4a-b261-c7e9-e2a08db02e48.htm
---
# Autodesk.Revit.DB.ExportPatternTable.Remove Method

**中文**: 删除、移除

Removes the pair (key, info) by pattern key.

## Syntax (C#)
```csharp
public void Remove(
	ExportPatternKey exportPatternKey
)
```

## Parameters
- **exportPatternKey** (`Autodesk.Revit.DB.ExportPatternKey`) - The export pattern key.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null